AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Хозрасчетный</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЭТ_ВыборДоговора/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокументОснованиеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.   

КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()  	
	ШаблонЗаявкаСтруктура = ЭТ_ОбщийМодуль2.ПолучитьШаблонПоискаЗаявки(Основание.ДоговорКонтрагента.Номер);
	ШаблонПоискаЗаявкаНомерЗагружено = ШаблонЗаявкаСтруктура.Номер;
	ШаблонПоискаНомерЗаявки = ШаблонЗаявкаСтруктура.Номер; 
	ДатаЗакрытияРасчетныхДокументов = ЭТ_ОбщийМодуль2.ПолучитьДатуЗакрытияРасчетныхДокументов();
	НомерЗаявки = ШаблонПоискаНомерЗаявки;
	Заявка = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(ШаблонПоискаНомерЗаявки);        	
	КодЗаявкиСБ = ?(Заявка.Свойство("id"),Заявка.id,0);
	Если Заявка.Количество()>0 Тогда 
		Если Заявка.Свойство("reservation_number") Тогда
			ШаблонПоискаНомерБрони = СокрЛП(Заявка.reservation_number);
			НомерБрони = ШаблонПоискаНомерБрони;
			Элементы.НомерБрони.Видимость = СтрДлина(ШаблонПоискаНомерБрони)>0;
		Иначе
			Элементы.НомерБрони.Видимость = Ложь;
		КонецЕсли;
		Если Заявка.Свойство("manager_surname") И Заявка.Свойство("manager_name") И Заявка.Свойство("manager_sname") Тогда
			ФИОМенеджера = СокрЛП(СокрЛП(Заявка.manager_surname) + " " + СокрЛП(Заявка.manager_name) + " " + СокрЛП(Заявка.manager_sname));
			МенеджерВЗаявке = ФИОМенеджера;
			Элементы.МенеджерВЗаявке.Видимость = СтрДлина(ФИОМенеджера)>0;
		Иначе
			Элементы.МенеджерВЗаявке.Видимость = Ложь;
		КонецЕсли;		
		Если Заявка.Свойство("supplier_name") Тогда
			ТуроператорВЗаявке = Заявка.supplier_name;
			ТуроператорВЗаявке = СокрЛП(СтрЗаменить(ТуроператорВЗаявке,"&quot;",""));
			Элементы.ТуроператорВЗаявке.Видимость = СтрДлина(ТуроператорВЗаявке)>0;
		Иначе
			Элементы.ТуроператорВЗаявке.Видимость = Ложь;
		КонецЕсли;
		Если Заявка.Свойство("services") Тогда
			ПартнерыВЗаявке.Очистить();
			Для Каждого СледУслуги Из Заявка.services Цикл
				Партнер_ИНН = ?(СледУслуги.Свойство("partner_inn"),СледУслуги.partner_inn,"");
				Партнер_Наименование = ?(СледУслуги.Свойство("partner_name"),СледУслуги.partner_name,"");
				Партнер_Наименование = СтрЗаменить(Партнер_Наименование,"&quot;","");
				Партнер_Оплачено = ?(СледУслуги.Свойство("price_netto"),?(СледУслуги.price_netto=Неопределено,0,СледУслуги.price_netto),0);
				Если Партнер_Оплачено>0 Тогда
					новСтрока = ПартнерыВЗаявке.Добавить();
					новСтрока.ИНН = Партнер_ИНН;
					новСтрока.Наименование = Партнер_Наименование;
					новСтрока.Оплачено = Партнер_Оплачено;
				КонецЕсли;
			КонецЦикла;			
			Элементы.ПартнерыВЗаявке.Видимость = ПартнерыВЗаявке.Количество()>0;
		Иначе
			Элементы.ПартнерыВЗаявке.Видимость = Ложь;
		КонецЕсли;
		
	
	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)        
	ПриОткрытииНаСервере();                    
	Элементы.ШаблонПоискаНомерЗаявки.СписокВыбора.Очистить();
	Элементы.ШаблонПоискаНомерЗаявки.СписокВыбора.Добавить(ШаблонПоискаНомерЗаявки,ШаблонПоискаНомерЗаявки);
	ПоискЗаявка(ЭтаФорма);

КонецПроцедуры

//    ВЫБРАТЬ
//	Хозрасчетный.Регистратор.ДоговорКонтрагента КАК РегистраторДоговорКонтрагента,
//	СУММА(Хозрасчетный.Сумма) КАК Сумма
//ИЗ
//	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
//ГДЕ
//	Хозрасчетный.Регистратор.Контрагент.Родитель.Наименование ПОДОБНО &Родитель
//	И Хозрасчетный.Регистратор.ВидОперации = &ВидОперации
//	И Хозрасчетный.Регистратор.ДоговорКонтрагента.Наименование ПОДОБНО &НомерДоговора

//СГРУППИРОВАТЬ ПО
//	Хозрасчетный.Регистратор.ДоговорКонтрагента

&НаКлиенте
Процедура Выбрать(Команда)                                   

	Закрыть(Параметры);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)         
	ВидОперации = Параметры.ВидОперации;
	Основание = Параметры.Основание;         
	ДоговорПокупателя = Основание.ДоговорКонтрагента;	
	//Заявка = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру();
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонПоискаЗаявки(НомерЗаявки)         
	Возврат ЭТ_ОбщийМодуль2.ПолучитьШаблонПоискаЗаявки(НомерЗаявки);
КонецФункции

&НаКлиенте
Процедура ШаблонПоискаНомерЗаявкиПриИзменении(Элемент)
	ШаблонЗаявкаСтруктура = ПолучитьШаблонПоискаЗаявки(ШаблонПоискаНомерЗаявки);
	ШаблонПоискаЗаявкаНомерВычислено = ШаблонЗаявкаСтруктура.Номер;
КонецПроцедуры

&НаСервере
Функция ПоискЗаявкаНаСервере(НомерДоговора,ЭтоБрнь=Ложь)    	
	Если СтрДлина(СокрЛП(НомерДоговора))<1 Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ШаблонПоиска = ЭТ_ОбщийМодуль2.ПолучитьШаблонПоискаЗаявки(НомерДоговора);

	Запрос = Новый Запрос;
	ЗапросДоговор = Новый Запрос;
	
	
	парВидОперации = Новый Массив;
	парВидОперации.Добавить(
		Перечисления["ВидыОперацийСписаниеДенежныхСредств"]["ОплатаПоставщику"]
	);	
	Запрос.УстановитьПараметр("ВидОперации", парВидОперации);                 
	
	Договоры = Новый Массив;                                                  
	

	Родитель = Новый Массив;                                                  
	КаталогПартнеров = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПартнеров",Справочники.Контрагенты.ПустаяСсылка());
	КаталогПоставщиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогПоставщиков",Справочники.Контрагенты.ПустаяСсылка());	
	Если Не КаталогПартнеров.Пустая() И Не КаталогПоставщиков.Пустая() Тогда
		Родитель.Добавить(КаталогПартнеров);
		Родитель.Добавить(КаталогПоставщиков);
	КонецЕсли;
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("РодительКоличество", Родитель.Количество());    
	Запрос.УстановитьПараметр("ДатаЗапрета", ЭТ_ОбщийМодуль2.ПолучитьДатуЗакрытияРасчетныхДокументов());    
		 


	
	ВидДоговора = Новый Массив;
	ВидДоговора.Добавить(Перечисления["ВидыДоговоровКонтрагентов"]["СПоставщиком"]);
	ВидДоговора.Добавить(Перечисления["ВидыДоговоровКонтрагентов"]["СКомитентом"]);	
	
	ЗапросДоговор.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Если ЭтоБрнь Тогда                
		ФорматНомерДоговора = СтрЗаменить(СтрЗаменить(СокрЛП(НомерДоговора),"  ","")," ","%");
		ЗапросДоговор.УстановитьПараметр("НомерДоговора", "%"+ФорматНомерДоговора+"%");
	Иначе
		ЗапросДоговор.УстановитьПараметр("НомерДоговора", "%"+ШаблонПоиска.ПрефиксПоиск+"%"+ШаблонПоиска.Номер+"%");
	КонецЕсли;
	ЗапросДоговор.Текст = 
		"ВЫБРАТЬ
| 			ДоговорыКонтрагентов.Ссылка КАК Ссылка           
| 		ИЗ
| 			Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
| 		ГДЕ
| 			ДоговорыКонтрагентов.Наименование ПОДОБНО &НомерДоговора
| 			И ДоговорыКонтрагентов.ВидДоговора В (&ВидДоговора)	
|";
	Запрос.УстановитьПараметр("Договоры", ЗапросДоговор.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
| 	Хозрасчетный.Регистратор.ДоговорКонтрагента КАК Договор,
| 	СУММА(Хозрасчетный.Сумма) КАК Сумма,
| 	МИНИМУМ(Хозрасчетный.Регистратор.Дата) КАК МинДатаПлатежа
| ПОМЕСТИТЬ ВыбДоговор
| ИЗ
| 	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
| ГДЕ
| 	(Хозрасчетный.Регистратор.Контрагент.Родитель В (&Родитель) ИЛИ (&РодительКоличество = 0))
| 	И Хозрасчетный.Регистратор.ВидОперации В (&ВидОперации)
| 	И Хозрасчетный.Регистратор.ДоговорКонтрагента В (&Договоры)
| СГРУППИРОВАТЬ ПО
| 	Хозрасчетный.Регистратор.ДоговорКонтрагента
| ;
| 
| ВЫБРАТЬ
| 	Договор КАК Договор,
| 	Договор.Владелец КАК Контрагент,
| 	Договор.Владелец.ИНН КАК КонтрагентИНН,
| 	Договор.ВидДоговора КАК ВидДоговора,
| 	Сумма КАК СуммаОплат,
| 	МинДатаПлатежа КАК МинДатаПлатежа,
|	ВЫБОР
|		КОГДА(МинДатаПлатежа<&ДатаЗапрета) ТОГДА Истина
|		ИНАЧЕ Ложь
|	КОНЕЦ КАК ЕстьОграничения
| ИЗ ВЫБДОГОВОР";
	

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	//Корректировка запрета             
	Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл
    	ИндСтроки = РезультатЗапроса.Индекс(СтрокаТЧ);
		РезультатЗапроса[ИндСтроки].ЕстьОграничения = 
			?(
				РезультатЗапроса[ИндСтроки].ЕстьОграничения 
				ИЛИ ДатыЗапретаИзмененияБП.ЗапрещеноРедактированиеПериода(
					РезультатЗапроса[ИндСтроки].МинДатаПлатежа,
					РезультатЗапроса[ИндСтроки].Договор.Организация
				),Истина,Ложь
			);
	КонецЦикла;
	
	
	Если РезультатЗапроса.Количество()>0 Тогда	
		ЭтаФорма.ТабДоговороы.Загрузить(РезультатЗапроса);
	КонецЕсли;
	Возврат РезультатЗапроса.Количество();

КонецФункции          

&НаКлиенте
Процедура ПоискЗаявка(Команда)
	Если СтрДлина(СокрЛП(ЭтаФорма.ШаблонПоискаНомерЗаявки))<1 Тогда
		ПоказатьПредупреждение(,"Стпрка с номером заявки пустая, введите номер заявки и повторите поиск",,"Введите номер заявки");			
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТабДоговороы.Очистить();	                      
	Если ПоискЗаявкаНаСервере(ЭтаФорма.ШаблонПоискаНомерЗаявки)<1 Тогда
		Если СтрДлина(СокрЛП(ЭтаФорма.ШаблонПоискаНомерБрони))>0 Тогда    
			   Оповещение = Новый ОписаниеОповещения("ПослеОтветаПоискПоНомеруБрони",ЭтотОбъект);
			   ПоказатьВопрос(Оповещение,
			        "Поиск договора поставщика по номеру договора не принес результата.",
			        РежимДиалогаВопрос.ДаНет,
			        0, // таймаут в секундах
			        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
			        "Выполнить поиск по номеру брони ?" // (необ.) заголовок
			    );    
		Иначе
			ПоказатьПредупреждение(,"Договор поставщика не найден, попробуйте поменять условия и повторить поиск.",,"Пустой результат запроса");	
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеОтветаПоискПоНомеруБрони(Результат, Параметры) ЭКСПОРТ
	Если Результат = КодВозвратаДиалога.Да Тогда
		Элементы.Группа6.ТекущаяСтраница = Элементы.Группа5;
        ПоискБронь(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ПоискБронь(Команда)    
	Если СтрДлина(СокрЛП(ЭтаФорма.ШаблонПоискаНомерБрони))<1 Тогда
		ПоказатьПредупреждение(,"Стпрка с номером брони пустая, введите номер брони и повторите поиск",,"Введите номер брони");			
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТабДоговороы.Очистить();	                      
	Если ПоискЗаявкаНаСервере(ЭтаФорма.ШаблонПоискаНомерБрони,Истина)<1 Тогда
		ПоказатьПредупреждение(,"Договор поставщика не найден, попробуйте поменять условия и повторить поиск.",,"Пустой результат запроса");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТабДоговороыВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ВидДоговораЯвляетсяСПоставщикомПоНомеруСтроки(НомерСтроки)
	Возврат ТабДоговороы[НомерСтроки].ВидДоговора = Строка(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);	
КонецФункции

&НаКлиенте
Процедура ТабДоговороыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	Если НЕ ВидДоговораЯвляетсяСПоставщикомПоНомеруСтроки(ВыбраннаяСтрока) Тогда                    
		ДополнительныеПараметры = Новый Структура("ВыбраннаяСтрока",ВыбраннаяСтрока);
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораНебходимостьСменыВидаДоговора",ЭтотОбъект,ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение,
		    "Выбранный вами договор не является договором с поставщиком."+Символы.ПС+"Вы действительно желаете изменить вид договора ?",
		    РежимДиалогаВопрос.ДаНет,
		    0, // таймаут в секундах
		    КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		    "Изменить вид договора ?" // (необ.) заголовок
		);    
	Иначе
		ДополнительныеПараметры = Новый Структура("ДоговорКонтрагента,Основание,НомерЗаявки,СуммаОплат,ДатаПлатежа",ТабДоговороы[ВыбраннаяСтрока].Договор,Основание,НомерЗаявки,ТабДоговороы[ВыбраннаяСтрока].СуммаОплат,ТабДоговороы[ВыбраннаяСтрока].МинДатаПлатежа);
		Форма = ПолучитьФорму("ОбщаяФорма.ЭТ_СозданиеПоступлениеУслуг",ДополнительныеПараметры);
    	Форма.Открыть();				
		//ЭтаФорма.Закрыть();
	КонецЕсли;
		
	ТабДоговороыВыборНаСервере();
КонецПроцедуры

&НаСервере
Функция КодЗаявкиСБ()
	Возврат КодЗаявкиСБ;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораНебходимостьСменыВидаДоговора(Результат, Параметры) ЭКСПОРТ
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ УстановитьВидДоговора(ТабДоговороы[Параметры.ВыбраннаяСтрока].Договор) Тогда
			ПоказатьПредупреждение(,"Не могу сменить вид договора",,"Ошибка");
		Иначе              
			ДополнительныеПараметры = Новый Структура("ДоговорКонтрагента,Основание,НомерЗаявки,СуммаОплат",ТабДоговороы[Параметры.ВыбраннаяСтрока].Договор,Основание,НомерЗаявки,ТабДоговороы[Параметры.ВыбраннаяСтрока].СуммаОплат);
			Форма = ПолучитьФорму("ОбщаяФорма.ЭТ_СозданиеПоступлениеУслуг",ДополнительныеПараметры);
	    	Форма.Открыть();				
			//ЭтаФорма.Закрыть();
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция УстановитьВидДоговора(ДоговорСсылка) 
	СписокДокументов = Новый ТаблицаЗначений;
	СписокДокументов.Колонки.Добавить("Дата");
	СписокДокументов.Колонки.Добавить("Документ");
	
	СостояниеМодуляЭТ = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь);
	ЭТ_ОбщийМодуль2.СохранитьНастройку("ВыключитьМодуль",Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|    СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|    КритерийОтбора.СвязанныеДокументы(&ДоговорСсылка) КАК СвязанныеДокументы
		|ГДЕ
		|    СвязанныеДокументы.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтрока = СписокДокументов.Добавить();
		НовСтрока.Дата = ВыборкаДетальныеЗаписи.Ссылка.Дата;
		НовСтрока.Документ = ВыборкаДетальныеЗаписи.Ссылка;
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;

	Попытка
		//Чиним договор
		Договор = ДоговорСсылка.ПолучитьОбъект();
		Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Получить(1);
		Договор.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	//Проводим документы обратно
	СписокДокументов.Сортировать("Дата", Новый СравнениеЗначений);
	Для Каждого СледДокумент Из СписокДокументов Цикл
    	Док = СледДокумент.Документ.ПолучитьОбъект();
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	

	Договор = ДоговорСсылка.ПолучитьОбъект();
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Получить(1) Тогда
		КВозврату = Истина;
	Иначе
		КВозврату = Ложь;
	КонецЕсли;

	ЭТ_ОбщийМодуль2.СохранитьНастройку("ВыключитьМодуль",СостояниеМодуляЭТ);
	Возврат КВозврату;	
КонецФункции
